<?php

$array = [
"Московская область" => ["Москва", "Зеленоград", "Клин"],
"Ленинградская область" => ["Санкт-Петербург", "Всеволожск", "Павловск", "Кронштадт"], 
"Тульская область" => ["Узловая", "Климовск", "Киреевск", "Липки"],
"Ивановская область" => ["Заволжск", "Кинешма", "Плес", "Комсомольск"]
];

foreach ($array as $region => $cities) {
	echo "$region:<br>";
	foreach ($cities as $key => $value) {
		$comma =($key < count($cities) - 1) ? ", " : "";
		echo  "$value" . $comma;
	}
	echo "<br>";
}